# pandas review and wrap-up
* * *


#### df = pd.DataFrame( {"a" : [4,5,6], "b": [7,8,9], "c" : [1,2,3]}, index = [1,2,3]) 
#### df['c']
#### df[['a','c']]
#### df.loc[1]
#### df.loc[3,'a']
#### 리스트 형식으로 dataframe 만들기

`df2 = pd.DataFrame(
        [[4,6,7], 
         [6,7,8], 
         [10,11,12]],
         index = [1,2,3],
         columns = ['a','b','c'])`
         **[ []. [] .[] .] 리스트 두번 사용**
#### df3 = pd.DataFrame(
        {'a':[4,5,7],
         'b':[10,11,12],
         'c':[1,5,7]},
         index = pd.MultiIndex.from_tuples(
          [ ('d',1), ('d',2),('e',2) ], 
           names = ['m','v'] ))
#### df3[df3.a<5]           
#### df.drop_duplicates(subset=None, keep='first', inplace=False)
#### df.a.isin([5])
#### df.a.isin([5,6])
#### df5.notnull() == pd.notnull(df5)
#### pd.DataFrame 연산자 
- & (and)
- | (or)
- ~ (not)
- ^ (xor)
- df.any() (any) 
- df.all() (all)
- df5[(df5.b==2) | (df5.a==1)]

In [2]:
import pandas as pd

In [11]:
#create dataframe by dict 

df = pd.DataFrame(
{"a" : [4,5,6], "b": [7,8,9], "c" : [1,2,3]}, index = [1,2,3])

In [12]:
df

   a  b  c
1  4  7  1
2  5  8  2
3  6  9  3

In [13]:
# select column c
df['c']

1    1
2    2
3    3
Name: c, dtype: int64

In [14]:
# select columns b, c
df[['a','c']]

   a  c
1  4  1
2  5  2
3  6  3

In [15]:
# select row 1
df.loc[1]

a    4
b    7
c    1
Name: 1, dtype: int64

In [19]:
# select row 3 and column a
df.loc[3,'a']

6

In [20]:
#select rows and coulmns
df.loc[[1,2],['a','b']]

   a  b
1  4  7
2  5  8

In [23]:
#create another dataframe by list style
df2 = pd.DataFrame(
        [[4,6,7],
         [6,7,8],
         [10,11,12]],
         index = [1,2,3],
         columns = ['a','b','c'])
df2

    a   b   c
1   4   6   7
2   6   7   8
3  10  11  12

In [24]:
#create Dataframe with a Multiindex
df3 = pd.DataFrame(
        {'a':[4,5,7],
         'b':[10,11,12],
         'c':[1,5,7]},
         index = pd.MultiIndex.from_tuples(
          [ ('d',1), ('d',2),('e',2) ],
           names = ['m','v'] ))
df3

     a   b  c
m v
d 1  4  10  1
  2  5  11  5
e 2  7  12  7

In [33]:
# subset observations (rows)
df3[df3.a<5]

     a   b  c
m v
d 1  4  10  1

In [26]:
df3[df3.b>7]

     a   b  c
m v
d 1  4  10  1
  2  5  11  5
e 2  7  12  7

In [27]:
df3.b>7

m  v
d  1    True
   2    True
e  2    True
Name: b, dtype: bool

In [31]:
df3[df3['c']>2]

     a   b  c
m v
d 2  5  11  5
e 2  7  12  7

In [32]:
df3['c']>2

m  v
d  1    False
   2     True
e  2     True
Name: c, dtype: bool

In [59]:
#중복 값 제거
df4 = pd.DataFrame(
[ [1,2,3,4],
  [1,2,3,4],
  [5,6,7,8],
  [1,5,7,4] ],
index = [1,2,3,4],
columns = ['a','b','c','d'])
df4
#list로 df만들때, [ [], []. ] 리스트로 한 번 더 감싸준다. 잊지말자

   a  b  c  d
1  1  2  3  4
2  1  2  3  4
3  5  6  7  8
4  1  5  7  4

In [43]:
df4.drop_duplicates()
#한 row에 value가 모두 같은 row가 있으면 중복으로 여겨 drop한다.
#하나의 valude라도 다른 경우 drop하지 않음.

   a  b  c  d
1  1  2  3  4
3  5  6  7  8
4  1  5  7  4

In [48]:
#drop 결과 index 1이 남았다.
#df.drop_duplicates?
# 기본 파라미터 df.drop_duplicates(subset=None, keep='first', inplace=False)
#keep 파라미터를 last로 변경하면 df4에서 1번 인덱스를 drop 하고 2번 인덱스를 keep 한다.
df4.drop_duplicates(keep = 'last')

   a  b  c  d
2  1  2  3  4
3  5  6  7  8
4  1  5  7  4

In [57]:
#drop 결과를 원본 df에 적용하려면 inplace = True 파라미터를 설정하면 된다.
#df4.drop_duplicates(inplace = True)
#이럴 경우 원본 데이터를 손실할 수 있으므로 권장하지 않는다.
#inplace 파라미터를 사용하는 대신 새로운 df4에 drop_duplicates()를 대입하면 원본 데이터도 보존할 수 있다.
df4.drop_duplicates(inplace = True)

In [58]:
df4

   a  b  c  d
1  1  2  3  4
3  5  6  7  8
4  1  5  7  4

In [61]:
#원본 df4에 drop된 결과를 대입하는 방식
#우측 항에서 drop된 df4를 좌측 항 df4에 넣는다는 뜻
df4 = df4.drop_duplicates()
df4

   a  b  c  d
1  1  2  3  4
3  5  6  7  8
4  1  5  7  4

In [62]:
df4['a'] != 2

1    True
3    True
4    True
Name: a, dtype: bool

In [64]:
df4['c'] != 3

1    False
3     True
4     True
Name: c, dtype: bool

In [66]:
df4[df4['c']!= 3]

   a  b  c  d
3  5  6  7  8
4  1  5  7  4

In [68]:
df.a.isin(5)

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

In [69]:
df.a.isin([5,6])

1    False
2     True
3     True
Name: a, dtype: bool

In [70]:
df['a'].isin([5])

1    False
2     True
3    False
Name: a, dtype: bool

In [71]:
pd.isnull(df4)

       a      b      c      d
1  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [74]:
import numpy as np
df5 = pd.DataFrame(
[ [1,np.nan,3,4],
  [1,2,3,4],
  [5,6,np.nan,8],
  [1,5,7,np.nan] ],
index = [1,2,3,4],
columns = ['a','b','c','d'])
df5

   a    b    c    d
1  1  NaN  3.0  4.0
2  1  2.0  3.0  4.0
3  5  6.0  NaN  8.0
4  1  5.0  7.0  NaN

In [73]:
pd.isnull(df5)

       a      b      c      d
1  False   True  False  False
2  False  False  False  False
3  False  False   True  False
4  False  False  False   True

In [75]:
df5['a'].isnull()

1    False
2    False
3    False
4    False
Name: a, dtype: bool

In [76]:
df5['b'].isnull().sum()

1

In [77]:
pd.notnull(df5)

      a      b      c      d
1  True  False   True   True
2  True   True   True   True
3  True   True  False   True
4  True   True   True  False

In [78]:
df5.notnull()

      a      b      c      d
1  True  False   True   True
2  True   True   True   True
3  True   True  False   True
4  True   True   True  False

In [79]:
df5.notnull().sum()

a    4
b    3
c    3
d    3
dtype: int64

In [80]:
df5.a.notnull().sum()

4

### pd.DataFrame 연산자
####  & (and)
####   | (or)
####  ~ (not)
####  ^ (xor)
#### df.any() (any)
#### df.all() (all)

In [85]:
any(df5)

True

In [82]:
df5.all()

a    True
b    True
c    True
d    True
dtype: bool

In [84]:
~df5.a.notnull()

1    False
2    False
3    False
4    False
Name: a, dtype: bool

In [89]:
df5.b

1    NaN
2    2.0
3    6.0
4    5.0
Name: b, dtype: float64

In [96]:
df5.d

1    4.0
2    4.0
3    8.0
4    NaN
Name: d, dtype: float64

In [119]:
df5=df5.astype(float)

In [140]:
df5[(df5.b==2) | (df5.a==1)]

     a    b    c    d
1  1.0  NaN  3.0  4.0
2  1.0  2.0  3.0  4.0
4  1.0  5.0  7.0  NaN